app/components/user_form_component.html.erb

SELECT "companies".* FROM "companies"
---
    <%= form.label :company_id, style: "display: block" %>
    <%= form.select :company_id, Company.all.map { |company| [company.name, company.id] } %>