app/controllers/companies_controller.rb

INSERT INTO "companies" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "company 1"], ["created_at", "2022-10-04 16:38:46.316972"], ["updated_at", "2022-10-04 16:38:46.316972"]]
---
  def create
    @company = Company.new(company_params)

    respond_to do |format|
      if @company.save