app/controllers/line_item_dates_controller.rb

SELECT "line_item_dates".* FROM "line_item_dates" WHERE "line_item_dates"."quote_id" = $1  [["quote_id", 1]]
---
  def index
    @line_item_dates = @quote.line_item_dates.all

INSERT INTO "line_item_dates" ("date", "created_at", "updated_at", "quote_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["date", "1995-05-19"], ["created_at", "2022-10-05 05:16:39.002861"], ["updated_at", "2022-10-05 05:16:39.002861"], ["quote_id", 1]]
---
  def create
    @line_item_date = @quote.line_item_dates.build(line_item_date_params)

    respond_to do |format|
      if @line_item_date.save

SELECT "quotes".* FROM "quotes" WHERE "quotes"."company_id" = $1 AND "quotes"."id" = $2 LIMIT $3  [["company_id", 4], ["id", 1], ["LIMIT", 1]]
---
    def set_quote
      @quote = current_company.quotes.find(params[:quote_id])

SELECT "line_item_dates".* FROM "line_item_dates" WHERE "line_item_dates"."quote_id" = $1 AND "line_item_dates"."id" = $2 LIMIT $3  [["quote_id", 1], ["id", 2], ["LIMIT", 1]]
---
    def set_line_item_date
      @line_item_date = @quote.line_item_dates.find(params[:id])