app/controllers/quotes_controller.rb

  def index
    @quotes = current_company.quotes.ordered
---
SELECT "quotes".* FROM "quotes" WHERE "quotes"."company_id" = $1 ORDER BY "quotes"."id" DESC  [["company_id", 4]]

  def create
    @quote = current_company.quotes.build(quote_params)

    respond_to do |format|
      if @quote.save
---
INSERT INTO "quotes" ("name", "created_at", "updated_at", "company_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "quote 1"], ["created_at", "2022-10-05 02:15:58.651238"], ["updated_at", "2022-10-05 02:15:58.651238"], ["company_id", 4]]

  def update
    respond_to do |format|
      if @quote.update(quote_params)
---
UPDATE "quotes" SET "name" = $1, "updated_at" = $2 WHERE "quotes"."id" = $3  [["name", "quote 44"], ["updated_at", "2022-10-05 03:29:59.760365"], ["id", 8]]