app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at", "company_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["email", "email3@gmail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2022-10-04 19:19:20.675388"], ["updated_at", "2022-10-04 19:19:20.675388"], ["company_id", 3]]